## Merge 3 datasets and finish final product

### Import libraries

In [1]:
import pandas as pd
import numpy as np
print("import completed")

import completed

### Import datasets

In [2]:
df_crime = pd.read_csv(r"./dataset/crime.csv")
df_uni = pd.read_csv(r"./dataset/uni_info.csv")
df_metro = pd.read_csv(r"./dataset/metro_startup_rank.csv")

### Preview all datasets

In [3]:
df_crime.head()

,MSA,ViolentCrime,Murder,Rape,Robbery,AggravatedAssault,PropertyCrime,Burglary,Theft,MotorVehicleTheft,State,City,TotalCrime
0,"Akron, OH M.S.A.",238.4,5.1,38.2,75.2,119.8,2552.4,575.3,1853.0,124.1,OH,Akron,5581.5
1,"Altoona, PA M.S.A.",216.5,0.8,28.7,25.5,161.6,1430.2,218.9,1163.6,47.8,PA,Altoona,3293.6
2,"Ames, IA M.S.A.",158.5,1.0,47.2,19.9,90.3,1848.3,311.7,1462.0,74.5,IA,Ames,4013.4
3,"Ann Arbor, MI M.S.A.",319.5,1.9,57.0,51.4,209.2,1791.9,290.4,1417.4,84.2,MI,AnnArbor,4222.9
4,"Appleton, WI M.S.A.",138.8,0.4,24.1,8.6,105.7,1394.9,206.6,1154.7,33.5,WI,Appleton,3067.3

In [4]:
df_uni.head()

,INSTNM,CITY,STABBR,LOCALE,CIP11ASSOC,CIP11BACHL
0,Alabama A & M University,Normal,AL,12.0,0.0,2.0
1,University of Alabama at Birmingham,Birmingham,AL,12.0,0.0,2.0
2,Amridge University,Montgomery,AL,12.0,2.0,2.0
3,University of Alabama in Huntsville,Huntsville,AL,12.0,0.0,2.0
4,Alabama State University,Montgomery,AL,12.0,0.0,2.0

In [5]:
df_metro.head()

                       Metro Area Name Metro Area Main City  Startup Rank Code
0         Austin-Round Rock-San Marcos               Austin             1   TX
1  Miami-Fort Lauderdale-Pompano Beach                Miami             2   FL
2       San Jose-Sunnyvale-Santa Clara              SanJose             3   CA
3     Los Angeles-Long Beach-Santa Ana           LosAngeles             4   CA
4             Denver-Aurora-Broomfield               Denver             5   CO

### Merge datasets (2 datasets each "merge turn")

In [6]:
df2 = pd.merge(
left = df_metro,
right = df_crime,
how = "inner",
left_on = ["Metro Area Main City", "Code"],
right_on = ["City", "State"]
)

In [7]:
df = pd.merge(
left = df_uni,
right = df2,
how = "inner",
left_on = ["CITY", "STABBR"],
right_on = ["City","State"]
)

### Drop irrelevant columns to finish final product

In [8]:
df = df.drop(axis = 1, columns = ["Metro Area Name", "Metro Area Main City", "Code", "MSA", "State", "City"])

### Re-check the product

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48 entries, 0 to 47
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   INSTNM             48 non-null     object
 1   CITY               48 non-null     object
 2   STABBR             48 non-null     object
 3   LOCALE             48 non-null     float64
 4   CIP11ASSOC         48 non-null     float64
 5   CIP11BACHL         48 non-null     float64
 6   Startup Rank       48 non-null     int64
 7   ViolentCrime       48 non-null     float64
 8   Murder             48 non-null     float64
 9   Rape               48 non-null     float64
 10  Robbery            48 non-null     float64
 11  AggravatedAssault  48 non-null     float64
 12  PropertyCrime      48 non-null     float64
 13  Burglary           48 non-null     float64
 14  Theft              48 non-null     float64
 15  MotorVehicleTheft  48 non-null     float64
 16  TotalCrime         48 non-null     float64
dtypes: float64(13), int64(1), object(3)
memory usage: 6.8+ KB

### Sort the final product due to requests

In [10]:
df = df.sort_values(by = ["Startup Rank", "TotalCrime"], ascending = [True, True])

### Export the product to "".csv" file

In [11]:
df.to_csv("./dataset/uni_list.csv", index = False)